Revit 2027 API
ElementId.CompareTo Method
Compares two element ids. Implementation of System.IComparable interface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int CompareTo(
	Object id
)
Public Overridable Function CompareTo (
	id As Object
) As Integer
public:
virtual int CompareTo(
	Object^ id
)
abstract CompareTo :
        id : Object -> int
override CompareTo :
        id : Object -> int
Parameters
id Object
The ElementId to be compared with this ElementId.
Return Value
Int32
 -1 if this element id is less than other id, 0 if equal, 1 if greater.
Implements
IComparable.CompareTo(Object)
See Also
Reference
ElementId Class
Autodesk.Revit.DB Namespace